{"positions":{"uniaden_it":{"title":"Head of IT for Uniaden","image":"http://40.media.tumblr.com/a2d503bd97bfac52fe44f8d896f6bbbe/tumblr_nn4f6jKGzN1stn28do1_1280.jpg","text":"Cool app","link":"uniaden.com","body":"<p>Text</p>\n<p>Something cool about Avatar the movie</p>\n"},"swecon":{"title":"Smart home concept","image":"img/swecon.svg","text":"Together with the startup Swedish Container Solutions me and some classmates created a smart home concept to conceptualize how a such a system could work in a container apartment.","link":"linkedin.com/in/viktorcarloskar","body":"<p>Text</p>\n<p>Something cool about Avatar the movie</p>\n"},"dedu_developer":{"title":"Web developer at DeDU since 2012","image":"img/energy.svg","text":"Developer of the leading facility management system in Sweden. Mostly front-end and special customer orders, for example I made a new visualization feature for the energy module.","link":"dedu.se","body":"<p>Text</p>\n<p>Something cool about Avatar the movie</p>\n"},"idag_inatt":{"title":"Project leader for IDag & Inatt","image":"img/id_badge.svg","text":"Project leader for the career day at my university program. The day featured inspiring talks from the companies Tactel, R/GA and Cloud Nine.","link":"linkedin.com/in/viktorcarloskar","body":"<p>Text</p>\n<p>Something cool about Avatar the movie</p>\n"},"uniaden_connect":{"title":"Team lead/developer of iOS/Android App for Uniaden","image":"img/uniaden-connect.svg","text":"Cool app","link":"stories","body":"<p>Text</p>\n<p>Something cool about Avatar the movie</p>\n"},"yamana":{"title":"Developer of YAMANA","image":"img/yamana.svg","text":"Makes events better by putting Instagram on the big screen!","link":"yamana.herokuapp.com","body":""}},"projects":{"2013-06-12 Spotify Desktop":{"title":"Rethinking Spotify desktop","date":"June 12, 2013","body":"<p>Me and some other interaction design students thought the Spotify desktop application needed some love. It had looked the same for some time, and Spotify also got a new graphic profile. So we decided to rethink how the Spotify desktop app could look like. We wanted to do this to challenge ourself and for us to have something fun and productive to do after school.</p>\n<p>This was just a fun challenge we decided to test out and we just wanted to challenge ourself. But through connections some designers at Spotify really like the idea and decided to act as a jury for our competition and also sponsored us with some prices.\n<img src=\"img/spotify-logo.png\" alt=\"The Spotify logotype\"></p>\n<h3 id=\"before\">Before</h3>\n<p>The old design (0.9.X) was too similar to iTunes; huge lists with a focus on fitting as much content into the window as possible. Most often I, the user, find what I’m looking for (if I’ve e.g. searched for a song) in the 10 results. I am also normally a big fan of dark UI’s, but I believe this one is too dark, and frankly, quite boring.\n<img src=\"img/old-spotify.jpg\" alt=\"Old Spotify desktop\"></p>\n<p><img src=\"img/spotify1.png\" alt=\"My Spotify desktop redesign\">\nMy biggest change to the whole application is the idea of a new menu system. I thought there was to much going on in the &quot;Playlist&quot; menu list. My concern with this was when new features and functions was introduced these will sort of &quot;push down&quot; the playlists and hide them. So one of the features of my redesign was a new &quot;mode switch&quot; allowing for different modes of the application allowing features to use the whole area between the header and the footer with the music controls. The idea of this mode switch is simple. Every mode gets to use the whole screen real estate and would allow for more immersive experiences in the Spotify apps. I also borrowed a lot of the colors in the newly released iPhone app and moved the now playing info to the footer bar.</p>\n<p><img src=\"img/spotify2.png\" alt=\"Spotify Social Screen\">\nThe second big change to in the design is more focus on the social functionality. Currently (May 2013) there is THREE different places to get notified about the social aspects of the Spotify service. So what I did was to create the mode &quot;News&quot; where all your notifications about new music, hottest playlists right now and friends liking something end up. This will create a space for exploring new music in the Spotify application.</p>\n<p>This was the first of hopefully many Photoshop battles me and some other my friends at the M.Sc in interaction design program in Umeå. I learned a lot, and are looking forward to more challenges like this.</p>\n<p>And last but not least, big thank&#39;s to Eric at Spotify and his team who actually took the time to look at our mockups. And don&#39;t hesitate to contact me if you have further questions about this.</p>\n"}}}